# 0. MySQL Connection

Connect to a local MySQL instance and make sure the connection is working.  The SQLAlchemy connection string
is stored as an environemnt variable DATABASE_URL

In [2]:
%load_ext sql

In [3]:
%sql select * from facilities;

9 rows affected.

[(0, 'Tennis Court 1', Decimal('5.0'), Decimal('25.0'), 10000, 200),
 (1, 'Tennis Court 2', Decimal('5.0'), Decimal('25.0'), 8000, 200),
 (2, 'Badminton Court', Decimal('0.0'), Decimal('15.5'), 4000, 50),
 (3, 'Table Tennis', Decimal('0.0'), Decimal('5.0'), 320, 10),
 (4, 'Massage Room 1', Decimal('9.9'), Decimal('80.0'), 4000, 3000),
 (5, 'Massage Room 2', Decimal('9.9'), Decimal('80.0'), 4000, 3000),
 (6, 'Squash Court', Decimal('3.5'), Decimal('17.5'), 5000, 80),
 (7, 'Snooker Table', Decimal('0.0'), Decimal('5.0'), 450, 15),
 (8, 'Pool Table', Decimal('0.0'), Decimal('5.0'), 400, 15)]

# Q1: Some of the facilities charge a fee to members, but some do not. Please list the names of the facilities that do.

In [4]:
%sql SELECT name FROM facilities WHERE membercost > 0

 * mysql+pymysql://springboard:***@localhost/country_club
5 rows affected.

[('Tennis Court 1',),
 ('Tennis Court 2',),
 ('Massage Room 1',),
 ('Massage Room 2',),
 ('Squash Court',)]

# Q2: How many facilities do not charge a fee to members?

In [5]:
%sql SELECT count(*) FROM facilities WHERE membercost = 0

 * mysql+pymysql://springboard:***@localhost/country_club
1 rows affected.

[(4,)]

In [6]:
%sql \
SELECT facid, name, membercost, monthlymaintenance FROM facilities \
WHERE membercost > 0 AND (membercost/monthlymaintenance)*100 < 20 \
ORDER BY membercost DESC

 * mysql+pymysql://springboard:***@localhost/country_club
5 rows affected.

[(4, 'Massage Room 1', Decimal('9.9'), 3000),
 (5, 'Massage Room 2', Decimal('9.9'), 3000),
 (0, 'Tennis Court 1', Decimal('5.0'), 200),
 (1, 'Tennis Court 2', Decimal('5.0'), 200),
 (6, 'Squash Court', Decimal('3.5'), 80)]

# Q4: How can you retrieve the details of facilities with ID 1 and 5? Write the query without using the OR operator.

In [7]:
%sql SELECT * FROM facilities WHERE facid IN (1, 5)

 * mysql+pymysql://springboard:***@localhost/country_club
2 rows affected.

[(1, 'Tennis Court 2', Decimal('5.0'), Decimal('25.0'), 8000, 200),
 (5, 'Massage Room 2', Decimal('9.9'), Decimal('80.0'), 4000, 3000)]

# Q5: How can you produce a list of facilities, with each labelled as 'cheap' or 'expensive', depending on if their monthly maintenance cost is more than $100? Return the name and monthly maintenance of the facilities in question.

In [8]:
%sql SELECT \
    name, \
    monthlymaintenance, \
    CASE \
        WHEN monthlymaintenance > 100 THEN 'expensive' \
        ELSE 'cheap' \
    END as facility_label \
FROM facilities \
ORDER BY monthlymaintenance DESC;

 * mysql+pymysql://springboard:***@localhost/country_club
9 rows affected.

[('Massage Room 1', 3000, 'expensive'),
 ('Massage Room 2', 3000, 'expensive'),
 ('Tennis Court 1', 200, 'expensive'),
 ('Tennis Court 2', 200, 'expensive'),
 ('Squash Court', 80, 'cheap'),
 ('Badminton Court', 50, 'cheap'),
 ('Snooker Table', 15, 'cheap'),
 ('Pool Table', 15, 'cheap'),
 ('Table Tennis', 10, 'cheap')]

# Q6: You'd like to get the first and last name of the last member(s) who signed up. Do not use the LIMIT clause for your solution.

In [9]:
%sql SELECT memid, firstname, surname FROM members WHERE memid = (SELECT MAX(memid) FROM members);

 * mysql+pymysql://springboard:***@localhost/country_club
1 rows affected.

[(37, 'Darren', 'Smith')]

# Q7: How can you produce a list of all members who have used a tennis court?Include in your output the name of the court, and the name of the member formatted as a single column. Ensure no duplicate data, and order by the member name.

In [10]:
%sql SELECT \
    DISTINCT members.memid, \
    CONCAT(surname, ', ', firstname) as member_name, \
    name as court_name \
FROM Bookings JOIN Members ON bookings.memid=members.memid JOIN Facilities ON bookings.facid=facilities.facid \
WHERE name like 'Tennis%' AND members.memid > 0 \
ORDER BY member_name;

 * mysql+pymysql://springboard:***@localhost/country_club
44 rows affected.

[(15, 'Bader, Florence', 'Tennis Court 2'),
 (15, 'Bader, Florence', 'Tennis Court 1'),
 (12, 'Baker, Anne', 'Tennis Court 1'),
 (12, 'Baker, Anne', 'Tennis Court 2'),
 (16, 'Baker, Timothy', 'Tennis Court 2'),
 (16, 'Baker, Timothy', 'Tennis Court 1'),
 (8, 'Boothe, Tim', 'Tennis Court 2'),
 (8, 'Boothe, Tim', 'Tennis Court 1'),
 (5, 'Butters, Gerald', 'Tennis Court 2'),
 (5, 'Butters, Gerald', 'Tennis Court 1'),
 (22, 'Coplin, Joan', 'Tennis Court 1'),
 (36, 'Crumpet, Erica', 'Tennis Court 1'),
 (7, 'Dare, Nancy', 'Tennis Court 2'),
 (7, 'Dare, Nancy', 'Tennis Court 1'),
 (28, 'Farrell, David', 'Tennis Court 2'),
 (28, 'Farrell, David', 'Tennis Court 1'),
 (13, 'Farrell, Jemima', 'Tennis Court 1'),
 (13, 'Farrell, Jemima', 'Tennis Court 2'),
 (20, 'Genting, Matthew', 'Tennis Court 1'),
 (35, 'Hunt, John', 'Tennis Court 1'),
 (35, 'Hunt, John', 'Tennis Court 2'),
 (11, 'Jones, David', 'Tennis Court 2'),
 (11, 'Jones, David', 'Tennis Court 1'),
 (26, 'Jones, Douglas', 'Tennis Court 1'),
 (4, 'Joplette, Janice', 'Tennis Court 1'),
 (4, 'Joplette, Janice', 'Tennis Court 2'),
 (10, 'Owen, Charles', 'Tennis Court 1'),
 (10, 'Owen, Charles', 'Tennis Court 2'),
 (17, 'Pinker, David', 'Tennis Court 1'),
 (30, 'Purview, Millicent', 'Tennis Court 2'),
 (3, 'Rownam, Tim', 'Tennis Court 2'),
 (3, 'Rownam, Tim', 'Tennis Court 1'),
 (27, 'Rumney, Henrietta', 'Tennis Court 2'),
 (24, 'Sarwin, Ramnaresh', 'Tennis Court 1'),
 (24, 'Sarwin, Ramnaresh', 'Tennis Court 2'),
 (1, 'Smith, Darren', 'Tennis Court 2'),
 (14, 'Smith, Jack', 'Tennis Court 2'),
 (14, 'Smith, Jack', 'Tennis Court 1'),
 (2, 'Smith, Tracy', 'Tennis Court 2'),
 (2, 'Smith, Tracy', 'Tennis Court 1'),
 (9, 'Stibbons, Ponder', 'Tennis Court 2'),
 (9, 'Stibbons, Ponder', 'Tennis Court 1'),
 (6, 'Tracy, Burton', 'Tennis Court 2'),
 (6, 'Tracy, Burton', 'Tennis Court 1')]

# Q8: How can you produce a list of bookings on the day of 2012-09-14 which will cost the member (or guest) more than $30? Remember that guests have different costs to members (the listed costs are per half-hour 'slot'), and the guest user's ID is always 0. Include in your output the name of the facility, the name of the member formatted as a single column, and the cost. Order by descending cost, and do not use any subqueries.

In [11]:
%sql \
SELECT \
    DATE(starttime) AS date, \
    bookid, \
    CASE \
        WHEN Members.memid=0 THEN 'GUEST' \
        ELSE concat(surname, ', ', firstname) \
    END AS user_name, \
    name as facility_name, \
    slots, \
    CASE \
        WHEN Members.memid=0 THEN guestcost*slots \
        ELSE membercost*slots \
    END AS booking_cost \
FROM Bookings JOIN Members ON Bookings.memid=Members.memid JOIN Facilities ON Bookings.facid=Facilities.facid \
WHERE \
    DATE(starttime)='2012-09-14' \
HAVING booking_cost > 30 \
ORDER BY booking_cost DESC;

 * mysql+pymysql://springboard:***@localhost/country_club
12 rows affected.

[(datetime.date(2012, 9, 14), 2946, 'GUEST', 'Massage Room 2', 4, Decimal('320.0')),
 (datetime.date(2012, 9, 14), 2937, 'GUEST', 'Massage Room 1', 2, Decimal('160.0')),
 (datetime.date(2012, 9, 14), 2940, 'GUEST', 'Massage Room 1', 2, Decimal('160.0')),
 (datetime.date(2012, 9, 14), 2942, 'GUEST', 'Massage Room 1', 2, Decimal('160.0')),
 (datetime.date(2012, 9, 14), 2926, 'GUEST', 'Tennis Court 2', 6, Decimal('150.0')),
 (datetime.date(2012, 9, 14), 2920, 'GUEST', 'Tennis Court 1', 3, Decimal('75.0')),
 (datetime.date(2012, 9, 14), 2922, 'GUEST', 'Tennis Court 1', 3, Decimal('75.0')),
 (datetime.date(2012, 9, 14), 2925, 'GUEST', 'Tennis Court 2', 3, Decimal('75.0')),
 (datetime.date(2012, 9, 14), 2948, 'GUEST', 'Squash Court', 4, Decimal('70.0')),
 (datetime.date(2012, 9, 14), 2941, 'Farrell, Jemima', 'Massage Room 1', 4, Decimal('39.6')),
 (datetime.date(2012, 9, 14), 2949, 'GUEST', 'Squash Court', 2, Decimal('35.0')),
 (datetime.date(2012, 9, 14), 2951, 'GUEST', 'Squash Court', 2, Decimal('35.0'))]

# Q9: This time, produce the same result as in Q8, but using a subquery.

See the submitted SQL file.  There seems to be an issue getting this query to run in Jupyter and I don't have time to solve it.

# Q10: Produce a list of facilities with a total revenue less than 1000. The output of facility name and total revenue, sorted by revenue. Remember that there's a different cost for guests and members!

In [12]:
%sql \
SELECT \
    facilities.name, \
    SUM(CASE \
            WHEN memid=0 THEN guestcost*slots \
            ELSE membercost*slots \
        END) AS revenue \
FROM Bookings JOIN Facilities ON Bookings.facid=Facilities.facid \
GROUP BY bookings.facid \
HAVING revenue < 1000 \
ORDER BY revenue DESC;

 * mysql+pymysql://springboard:***@localhost/country_club
3 rows affected.

[('Pool Table', Decimal('270.0')),
 ('Snooker Table', Decimal('240.0')),
 ('Table Tennis', Decimal('180.0'))]